telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app.h"
#include "board.h"
#include "fsl_clock.h"
#include "fsl_common.h"
#include "fsl_debug_console.h"
#include "fsl_gt911.h"
#include "fsl_i3c.h"
#include "fsl_lpi2c.h"
#include "fsl_port.h"
#include "gauge_render.h"
#include "power_data_source.h"
#include "anomaly_engine.h"
#include "accel4_click.h"
#include "fxls8974cf.h"
#include "ext_flash_recorder.h"

#define TOUCH_I2C LPI2C2
#define TOUCH_I2C_FLEXCOMM_INDEX 2u
#define TOUCH_POINTS 5u
#define TOUCH_INT_PORT PORT4
#define TOUCH_INT_PIN 6u
#define ACCEL_I2C LPI2C3
#define ACCEL_I2C_FLEXCOMM_INDEX 3u
#define TEMP_I3C I3C1
#define TEMP_I3C_INDEX 1u
#define BOARD_TEMP_REG 0x00u
#define TEMP_SENSOR_STATIC_ADDR 0x48u
#define TEMP_SENSOR_DYNAMIC_ADDR 0x08u
#define I3C_BROADCAST_ADDR 0x7Eu
#define I3C_CCC_RSTDAA 0x06u
#define I3C_CCC_SETDASA 0x87u
#define SHIELD_GYRO_ADDR0 0x6Au
#define SHIELD_GYRO_ADDR1 0x6Bu
#define SHIELD_GYRO_REG_WHO_AM_I 0x0Fu
#define SHIELD_GYRO_REG_CTRL1_XL 0x10u
#define SHIELD_GYRO_REG_CTRL2_G 0x11u
#define SHIELD_GYRO_REG_CTRL3_C 0x12u
#define SHIELD_GYRO_REG_OUTX_L_G 0x22u
#define SHIELD_GYRO_REG_OUTX_L_A 0x28u
#define SHIELD_IMU_WHOAMI_LSM6DSO16IS 0x22u
#define SHIELD_IMU_WHOAMI_LSM6DSV16X 0x70u
#define SHIELD_LIS2DUXS12_ADDR0 0x18u
#define SHIELD_LIS2DUXS12_ADDR1 0x19u
#define SHIELD_LIS2DUXS12_WHOAMI 0x47u
#define SHIELD_LIS2MDL_ADDR 0x1Eu
#define SHIELD_LIS2MDL_REG_WHO_AM_I 0x4Fu
#define SHIELD_LIS2MDL_WHOAMI 0x40u
#define SHIELD_LPS22DF_ADDR0 0x5Cu
#define SHIELD_LPS22DF_ADDR1 0x5Du
#define SHIELD_LPS22DF_WHOAMI 0xB4u

#define TOUCH_POLL_DELAY_US 10000u
#define POWER_TICK_PERIOD_US 1000000u
#define DISPLAY_REFRESH_PERIOD_US 100000u
#define RECPLAY_TICK_PERIOD_US 100000u
#define GYRO_REFRESH_PERIOD_US 100000u
#define ACCEL_LIVE_PERIOD_US 100000u
#define RUNTIME_CLOCK_PERIOD_US 100000u
#define TEMP_REFRESH_PERIOD_US 100000u
#define ACCEL_TEST_LOG_PERIOD_US 1000000u
#ifndef EDGEAI_ENABLE_ACCEL_TEST_LOG
#define EDGEAI_ENABLE_ACCEL_TEST_LOG 0
#endif
#ifndef EDGEAI_ENABLE_SHIELD_SCAN_DIAG
#define EDGEAI_ENABLE_SHIELD_SCAN_DIAG 0
#endif
#ifndef EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG
#define EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG 0
#endif
#ifndef EDGEAI_I2C_RETRY_COUNT
#define EDGEAI_I2C_RETRY_COUNT 3u
#endif

static gt911_handle_t s_touch_handle;
static bool s_touch_ready = false;
static bool s_touch_was_down = false;
static bool s_touch_i2c_inited = false;
static bool s_accel_i2c_inited = false;
static bool s_accel_ready = false;
static fxls8974_dev_t s_accel_dev;
static int16_t s_accel_x_mg = 0;
static int16_t s_accel_y_mg = 0;
static int16_t s_accel_z_mg = 1000;
static bool s_shield_gyro_ready = false;
static uint8_t s_shield_gyro_addr = 0u;
static uint8_t s_shield_gyro_who = 0u;
static bool s_shield_use_touch_bus = true;
static bool s_shield_gyro_missing_logged = false;
static bool s_shield_gyro_read_fail_logged = false;
static uint8_t s_shield_gyro_read_fail_streak = 0u;
static int16_t s_ui_gyro_x = 0;
static int16_t s_ui_gyro_y = 0;
static int16_t s_ui_gyro_z = 0;
static bool s_temp_ready = false;
static bool s_temp_i3c_inited = false;
static uint8_t s_temp_addr = 0u;
static uint8_t s_temp_c = 25u;
static int16_t s_temp_c10 = 250;
static i3c_bus_type_t s_temp_bus_type = kI3C_TypeI2C;
static power_sample_t s_frame_sample;
static anomaly_output_t s_anom_out;
static bool BoardTempI3CInit(void);
static bool TouchI2CInit(void);
static bool AccelI2CInit(void);

typedef struct
{
    uint8_t addr;
    uint8_t reg;
    const char *name;
} diag_probe_t;

static const diag_probe_t kDiagProbes[] = {
    {0x6Au, 0x0Fu, "IMU_A"},
    {0x6Bu, 0x0Fu, "IMU_B"},
    {0x18u, 0x0Fu, "LIS2DUXS12_A"},
    {0x19u, 0x0Fu, "LIS2DUXS12_B"},
    {0x1Eu, 0x4Fu, "LIS2MDL"},
    {0x5Cu, 0x0Fu, "LPS22DF_A"},
    {0x5Du, 0x0Fu, "LPS22DF_B"},
    {0x44u, 0x89u, "SHT4x_CMD"},
    {0x45u, 0x89u, "SHT4x_CMD_ALT"},
    {0x5Du, 0x0Fu, "STTS22H?"},
    {0x3Cu, 0x4Fu, "LIS2MDL_ALT8"},
};

static void ClockFromDeciseconds(uint32_t ds_total, uint8_t *hh, uint8_t *mm, uint8_t *ss, uint8_t *ds)
{
    uint32_t sec_total = ds_total / 10u;
    uint32_t rem_ds = ds_total % 10u;
    uint32_t hh_v = (sec_total / 3600u) % 24u;
    uint32_t mm_v = (sec_total % 3600u) / 60u;
    uint32_t ss_v = sec_total % 60u;

    if (hh != NULL)
    {
        *hh = (uint8_t)hh_v;
    }
    if (mm != NULL)
    {
        *mm = (uint8_t)mm_v;
    }
    if (ss != NULL)
    {
        *ss = (uint8_t)ss_v;
    }
    if (ds != NULL)
    {
        *ds = (uint8_t)rem_ds;
    }
}

static uint8_t ChannelLevelPct(anomaly_level_t lvl)
{
    if (lvl >= ANOMALY_LEVEL_MAJOR)
    {
        return 100u;
    }
    if (lvl >= ANOMALY_LEVEL_MINOR)
    {
        return 80u;
    }
    if (lvl >= ANOMALY_LEVEL_WATCH)
    {
        return 40u;
    }
    return 5u;
}

static void ApplyAnomalyToFrame(power_sample_t *dst)
{
    uint8_t overall = (uint8_t)s_anom_out.overall_level;
    uint8_t ax = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AX]);
    uint8_t ay = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AY]);
    uint8_t az = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AZ]);
    uint8_t tp = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_TEMP]);
    uint8_t maxch = ax;

    if (dst == NULL)
    {
        return;
    }

    if (ay > maxch)
    {
        maxch = ay;
    }
    if (az > maxch)
    {
        maxch = az;
    }
    if (tp > maxch)
    {
        maxch = tp;
    }

    dst->anomaly_score_pct = maxch;
    dst->connector_risk_pct = ax;
    dst->wire_risk_pct = ay;
    dst->thermal_damage_risk_pct = tp;
    dst->degradation_drift_pct = az;
    dst->thermal_risk_s = 0u;

    if (overall >= (uint8_t)ANOMALY_LEVEL_MAJOR)
    {
        dst->ai_status = AI_STATUS_FAULT;
    }
    else if (overall >= (uint8_t)ANOMALY_LEVEL_WATCH)
    {
        dst->ai_status = AI_STATUS_WARNING;
    }
    else
    {
        dst->ai_status = AI_STATUS_NORMAL;
    }

    dst->ai_fault_flags = 0u;
}

static void AccelAxisSelfTestLog(void)
{
#if EDGEAI_ENABLE_ACCEL_TEST_LOG
    int32_t ax = s_accel_x_mg;
    int32_t ay = s_accel_y_mg;
    int32_t az = s_accel_z_mg;
    int32_t abx = (ax < 0) ? -ax : ax;
    int32_t aby = (ay < 0) ? -ay : ay;
    int32_t abz = (az < 0) ? -az : az;
    char axis = 'X';
    int32_t val = ax;

    if (aby > abx)
    {
        axis = 'Y';
        val = ay;
        abx = aby;
    }
    if (abz > abx)
    {
        axis = 'Z';
        val = az;
    }

    PRINTF("ACCEL_TEST,DOM=%c%s,X=%d,Y=%d,Z=%d\r\n",
           axis, (val >= 0) ? "+" : "-", (int)ax, (int)ay, (int)az);
#else
    /* Disabled by default to avoid periodic UART blocking in the render loop. */
#endif
}

