telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static bool ShieldBusProbeAddress(bool use_touch_bus, uint8_t deviceAddress)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static void __attribute__((unused)) ShieldScanI2CAddresses(bool use_touch_bus, const char *bus_name)
{
    bool found = false;
    PRINTF("SHIELD scan %s addr:", bus_name);
    for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
    {
        if (ShieldBusProbeAddress(use_touch_bus, addr))
        {
            PRINTF(" 0x%02x", (unsigned int)addr);
            found = true;
        }
    }
    if (!found)
    {
        PRINTF(" none");
    }
    PRINTF("\r\n");
}

static bool __attribute__((unused)) DiagLpi2cInit(LPI2C_Type *base, uint32_t fc_idx, uint32_t baud_hz)
{
    lpi2c_master_config_t cfg;
    uint32_t src_hz;

    if ((base == TOUCH_I2C) && !s_touch_i2c_inited)
    {
        CLOCK_SetClkDiv(kCLOCK_DivFlexcom2Clk, 1u);
        CLOCK_AttachClk(kFRO12M_to_FLEXCOMM2);
    }
    if ((base == ACCEL_I2C) && !s_accel_i2c_inited)
    {
        CLOCK_SetClkDiv(kCLOCK_DivFlexcom3Clk, 1u);
        CLOCK_AttachClk(kFRO12M_to_FLEXCOMM3);
    }

    src_hz = CLOCK_GetLPFlexCommClkFreq(fc_idx);
    if (src_hz == 0u)
    {
        return false;
    }
    LPI2C_MasterGetDefaultConfig(&cfg);
    cfg.baudRate_Hz = baud_hz;
    LPI2C_MasterDeinit(base);
    LPI2C_MasterInit(base, &cfg, src_hz);
    return true;
}

static bool __attribute__((unused)) DiagLpi2cProbeAddr(LPI2C_Type *base, uint8_t addr7)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    return (LPI2C_MasterTransferBlocking(base, &xfer) == kStatus_Success);
}

static bool __attribute__((unused)) DiagLpi2cReadReg(LPI2C_Type *base, uint8_t addr7, uint8_t reg, uint8_t *val)
{
    lpi2c_master_transfer_t xfer;
    if (val == NULL)
    {
        return false;
    }
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = val;
    xfer.dataSize = 1u;
    return (LPI2C_MasterTransferBlocking(base, &xfer) == kStatus_Success);
}

static void __attribute__((unused)) DiagScanLpi2cBus(const char *name, LPI2C_Type *base, uint32_t fc_idx)
{
    static const uint32_t bauds[] = {100000u, 400000u};
    for (uint32_t bi = 0u; bi < (sizeof(bauds) / sizeof(bauds[0])); bi++)
    {
        bool any = false;
        if (!DiagLpi2cInit(base, fc_idx, bauds[bi]))
        {
            PRINTF("DIAG %s %luHz: init_failed\r\n", name, (unsigned long)bauds[bi]);
            continue;
        }
        PRINTF("DIAG %s %luHz addr:", name, (unsigned long)bauds[bi]);
        for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
        {
            if (DiagLpi2cProbeAddr(base, addr))
            {
                PRINTF(" 0x%02x", (unsigned int)addr);
                any = true;
            }
        }
        if (!any)
        {
            PRINTF(" none");
        }
        PRINTF("\r\n");

        for (uint32_t pi = 0u; pi < (sizeof(kDiagProbes) / sizeof(kDiagProbes[0])); pi++)
        {
            uint8_t who = 0u;
            if (DiagLpi2cReadReg(base, kDiagProbes[pi].addr, kDiagProbes[pi].reg, &who))
            {
                PRINTF("DIAG %s %luHz %s addr=0x%02x reg=0x%02x val=0x%02x\r\n",
                       name,
                       (unsigned long)bauds[bi],
                       kDiagProbes[pi].name,
                       (unsigned int)kDiagProbes[pi].addr,
                       (unsigned int)kDiagProbes[pi].reg,
                       (unsigned int)who);
            }
        }
    }
}

static bool __attribute__((unused)) DiagI3CProbeAddrI2C(uint8_t addr7)
{
    i3c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kI3C_TransferDefaultFlag;
    xfer.slaveAddress = addr7;
    xfer.direction = kI3C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    xfer.busType = kI3C_TypeI2C;
    xfer.ibiResponse = kI3C_IbiRespAck;
    return (I3C_MasterTransferBlocking(TEMP_I3C, &xfer) == kStatus_Success);
}

static void ShieldRunDatastreamDiagnostics(void)
{
#if EDGEAI_ENABLE_SHIELD_SCAN_DIAG
    bool any_i3c = false;
    PRINTF("DIAG start shield datastream scan\r\n");
    DiagScanLpi2cBus("FC2", TOUCH_I2C, TOUCH_I2C_FLEXCOMM_INDEX);
    DiagScanLpi2cBus("FC3", ACCEL_I2C, ACCEL_I2C_FLEXCOMM_INDEX);

    if (BoardTempI3CInit())
    {
        PRINTF("DIAG I3C1(I2C-mode) addr:");
        for (uint8_t addr = 0x08u; addr <= 0x77u; addr++)
        {
            if (DiagI3CProbeAddrI2C(addr))
            {
                PRINTF(" 0x%02x", (unsigned int)addr);
                any_i3c = true;
            }
        }
        if (!any_i3c)
        {
            PRINTF(" none");
        }
        PRINTF("\r\n");
    }
    else
    {
        PRINTF("DIAG I3C1 init_failed\r\n");
    }
    PRINTF("DIAG done shield datastream scan\r\n");
#endif
}

static const char *ShieldImuName(uint8_t who)
{
    if (who == SHIELD_IMU_WHOAMI_LSM6DSO16IS)
    {
        return "LSM6DSO16IS";
    }
    if (who == SHIELD_IMU_WHOAMI_LSM6DSV16X)
    {
        return "LSM6DSV16X";
    }
    return "UNKNOWN";
}

static void ShieldSensorScanLog(void)
{
#if EDGEAI_ENABLE_SHIELD_SENSOR_SCAN_LOG
    static const bool buses[2] = {true, false};
    static const char *bus_name[2] = {"FC2", "FC3"};
    uint8_t who = 0u;

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        bool use_touch_bus = buses[bi];
        ShieldScanI2CAddresses(use_touch_bus, bus_name[bi]);
        if (ShieldBusRead(use_touch_bus, SHIELD_LIS2DUXS12_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) ||
            ShieldBusRead(use_touch_bus, SHIELD_LIS2DUXS12_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LIS2DUXS12 who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LIS2DUXS12_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LIS2DUXS12 not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusRead(use_touch_bus, SHIELD_LPS22DF_ADDR0, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u) ||
            ShieldBusRead(use_touch_bus, SHIELD_LPS22DF_ADDR1, SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LPS22DF who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LPS22DF_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LPS22DF not_found\r\n", bus_name[bi]);
        }

        if (ShieldBusRead(use_touch_bus, SHIELD_LIS2MDL_ADDR, SHIELD_LIS2MDL_REG_WHO_AM_I, &who, 1u))
        {
            PRINTF("SHIELD probe %s LIS2MDL who=0x%02x %s\r\n",
                   bus_name[bi],
                   (unsigned int)who,
                   (who == SHIELD_LIS2MDL_WHOAMI) ? "ok" : "unexpected");
        }
        else
        {
            PRINTF("SHIELD probe %s LIS2MDL not_found\r\n", bus_name[bi]);
        }
    }
#endif
}

