telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static void TouchConfigIntPin(gt911_int_pin_mode_t mode)
{
    CLOCK_EnableClock(kCLOCK_Port4);

    port_pin_config_t cfg = {
        .pullSelect = kPORT_PullDown,
        .pullValueSelect = kPORT_LowPullResistor,
        .slewRate = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable = kPORT_OpenDrainDisable,
        .driveStrength = kPORT_LowDriveStrength,
#if defined(FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH1) && FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH1
        .driveStrength1 = kPORT_NormalDriveStrength,
#endif
        .mux = kPORT_MuxAlt0,
        .inputBuffer = kPORT_InputBufferEnable,
        .invertInput = kPORT_InputNormal,
        .lockRegister = kPORT_UnlockRegister,
    };

    switch (mode)
    {
        case kGT911_IntPinPullUp:
            cfg.pullSelect = kPORT_PullUp;
            break;
        case kGT911_IntPinPullDown:
            cfg.pullSelect = kPORT_PullDown;
            break;
        case kGT911_IntPinInput:
            cfg.pullSelect = kPORT_PullDisable;
            break;
        default:
            break;
    }

    PORT_SetPinConfig(TOUCH_INT_PORT, TOUCH_INT_PIN, &cfg);
}

static void TouchConfigResetPin(bool pullUp)
{
    (void)pullUp;
}

static void TouchInit(void)
{
    gt911_config_t touch_cfg = {
        .I2C_SendFunc = TouchI2CSend,
        .I2C_ReceiveFunc = TouchI2CReceive,
        .timeDelayMsFunc = TouchDelayMs,
        .intPinFunc = TouchConfigIntPin,
        .pullResetPinFunc = TouchConfigResetPin,
        .touchPointNum = TOUCH_POINTS,
        .i2cAddrMode = kGT911_I2cAddrMode1,
        .intTrigMode = kGT911_IntFallingEdge,
    };
    status_t st;

    s_touch_ready = false;
    s_touch_was_down = false;

    if (!TouchI2CInit())
    {
        return;
    }

    st = GT911_Init(&s_touch_handle, &touch_cfg);
    if (st != kStatus_Success)
    {
        /* Fallback: some panels come up strapped to 0x5D. */
        touch_cfg.i2cAddrMode = kGT911_I2cAddrMode0;
        st = GT911_Init(&s_touch_handle, &touch_cfg);
    }
    if (st == kStatus_Success)
    {
        s_touch_ready = true;
        PRINTF("TOUCH ready: GT911 (%u x %u)\r\n",
               (unsigned int)s_touch_handle.resolutionX,
               (unsigned int)s_touch_handle.resolutionY);
    }
    else
    {
        PRINTF("TOUCH init failed: GT911 status=%d\r\n", (int)st);
    }
}

static void __attribute__((unused)) AccelInit(void)
{
    static const uint8_t addrs[2] = {ACCEL4_CLICK_I2C_ADDR0, ACCEL4_CLICK_I2C_ADDR1};
    uint8_t who = 0u;

    s_accel_ready = false;
    s_accel_dev.addr7 = 0u;
    s_accel_dev.write = AccelI2CWrite;
    s_accel_dev.read = AccelI2CRead;

    if (!AccelI2CInit())
    {
        GaugeRender_SetAccel(0, 0, 1000, false);
        return;
    }

    for (uint32_t i = 0u; i < 2u; i++)
    {
        s_accel_dev.addr7 = addrs[i];
        if (fxls8974_read_whoami(&s_accel_dev, &who) && (who == FXLS8974_WHO_AM_I_VALUE))
        {
            s_accel_ready = true;
            break;
        }
    }

    if (!s_accel_ready)
    {
        PRINTF("ACCEL not found (WHO_AM_I=0x%02x)\r\n", (unsigned int)who);
        GaugeRender_SetAccel(0, 0, 1000, false);
        return;
    }

    (void)fxls8974_set_active(&s_accel_dev, false);
    (void)fxls8974_set_fsr(&s_accel_dev, FXLS8974_FSR_4G);
    (void)fxls8974_set_active(&s_accel_dev, true);
    PRINTF("ACCEL ready addr=0x%02x\r\n", (unsigned int)s_accel_dev.addr7);
}

static void __attribute__((unused)) AccelUpdate(void)
{
    fxls8974_sample_t raw;
    int32_t x_mg;
    int32_t y_mg;
    int32_t z_mg;
    int16_t filt_x;
    int16_t filt_y;
    int16_t filt_z;

    if (!s_accel_ready)
    {
        return;
    }

    if (!fxls8974_read_sample_12b(&s_accel_dev, &raw))
    {
        return;
    }

    /* FXLS8974 raw is 12-bit signed. For +/-4g, 1 LSB ~= 1.953 mg. */
    x_mg = ((int32_t)raw.x * 125) / 64;
    y_mg = ((int32_t)raw.y * 125) / 64;
    z_mg = ((int32_t)raw.z * 125) / 64;

    /* Simple low-pass to keep the gyro view stable. */
    filt_x = (int16_t)((s_accel_x_mg * 3 + x_mg) / 4);
    filt_y = (int16_t)((s_accel_y_mg * 3 + y_mg) / 4);
    filt_z = (int16_t)((s_accel_z_mg * 3 + z_mg) / 4);

    /* Requested mapping change: swap X and Y axes globally. */
    s_accel_x_mg = filt_y;
    s_accel_y_mg = filt_x;
    s_accel_z_mg = filt_z;
}

static void ShieldGyroInit(void)
{
    static const bool buses[2] = {true, false};
    static const char *bus_name[2] = {"FC2", "FC3"};
    static const uint8_t addrs[2] = {SHIELD_GYRO_ADDR0, SHIELD_GYRO_ADDR1};
    uint8_t who = 0u;

    s_shield_gyro_ready = false;
    s_shield_gyro_addr = 0u;
    s_shield_gyro_who = 0u;
    s_shield_use_touch_bus = true;
    s_ui_gyro_x = 0;
    s_ui_gyro_y = 0;
    s_ui_gyro_z = 0;

    for (uint32_t bi = 0u; bi < 2u; bi++)
    {
        bool use_touch_bus = buses[bi];
        for (uint32_t i = 0u; i < 2u; i++)
        {
            if (!ShieldBusRead(use_touch_bus, addrs[i], SHIELD_GYRO_REG_WHO_AM_I, &who, 1u))
            {
                continue;
            }
            if ((who == SHIELD_IMU_WHOAMI_LSM6DSO16IS) || (who == SHIELD_IMU_WHOAMI_LSM6DSV16X))
            {
                s_shield_gyro_ready = true;
                s_shield_gyro_addr = addrs[i];
                s_shield_gyro_who = who;
                s_shield_use_touch_bus = use_touch_bus;
                PRINTF("SHIELD_GYRO bus=%s\r\n", bus_name[bi]);
                break;
            }
        }
        if (s_shield_gyro_ready)
        {
            break;
        }
    }

    if (!s_shield_gyro_ready)
    {
        if (!s_shield_gyro_missing_logged)
        {
            PRINTF("SHIELD_GYRO not found (last WHO_AM_I=0x%02x)\r\n", (unsigned int)who);
            s_shield_gyro_missing_logged = true;
        }
        return;
    }
    s_shield_gyro_missing_logged = false;
    s_shield_gyro_read_fail_logged = false;
    s_shield_gyro_read_fail_streak = 0u;

    /* LSM6-family setup: BDU + auto-increment, accel ODR=104Hz FS=4g, gyro ODR=104Hz FS=2000 dps. */
    if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_CTRL3_C, 0x44u) ||
        !ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_CTRL1_XL, 0x48u) ||
        !ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_CTRL2_G, 0x4Cu))
    {
        s_shield_gyro_ready = false;
        PRINTF("SHIELD_GYRO cfg failed addr=0x%02x\r\n", (unsigned int)s_shield_gyro_addr);
        return;
    }
    PRINTF("SHIELD_GYRO ready addr=0x%02x who=0x%02x (%s)\r\n",
           (unsigned int)s_shield_gyro_addr,
           (unsigned int)s_shield_gyro_who,
           ShieldImuName(s_shield_gyro_who));
}

static void ShieldGyroUpdate(void)
{
    uint8_t raw_g[6];
    uint8_t raw_a[6];
    int16_t gx_raw;
    int16_t gy_raw;
    int16_t gz_raw;
    int16_t ax_raw;
    int16_t ay_raw;
    int16_t az_raw;
    int32_t gx_mdps;
    int32_t gy_mdps;
    int32_t gz_mdps;
    int32_t ax_mg;
    int32_t ay_mg;
    int32_t az_mg;
    int32_t disp_x;
    int32_t disp_y;
    int32_t disp_z;
    int16_t gx_ui;
    int16_t gy_ui;
    int16_t gz_ui;
    int16_t filt_ax;
    int16_t filt_ay;
    int16_t filt_az;

